perf/artillery-local.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 2
      name: "Warmup"

    - duration: 30
      arrivalRate: 5
      name: "Steady"

    - duration: 20
      arrivalRate: 10
      name: "Stress"

    - duration: 15
      arrivalRate: 20
      name: "Spike"

    - duration: 10
      arrivalRate: 2
      name: "Cooldown"

  plugins:
    metrics-by-endpoint: {}

  defaults:
    headers:
      Content-Type: application/json

  ensure:
    thresholds:
      - http.response_time.p50: 50
      - http.response_time.p95: 200
      - http.response_time.p99: 500

scenarios:
  - name: "Full Workflow"
    weight: 65
    flow:
      - post:
          url: "/auth/token"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200

      - think: 1

      - post:
          url: "/logs"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            message: "Stress test {{ $timestamp }}"
          expect:
            - statusCode: 202
          capture:
            - json: "$.correlationId"
              as: "correlationId"

      - get:
          url: "/logs/{{ correlationId }}"
          expect:
            - statusCode: 200

      - think: 1

      - get:
          url: "/metrics"
          expect:
            - statusCode: 200

  - name: "Token Generation Only"
    weight: 20
    flow:
      - post:
          url: "/auth/token"
          expect:
            - statusCode: 200

  - name: "Metrics Polling"
    weight: 15
    flow:
      - get:
          url: "/metrics"
          expect:
            - statusCode: 200